In [39]:
import pandas as pd

### join:

Joins two dataframes based on their indices.
Can be used to combine data based on inner, outer, left, or right joins.
Can handle non-matching values in the indices being joined.
Can handle multiple indices being joined at once.
The resulting dataframe may have new columns and rows depending on how the join is performed.

In [44]:
left = pd.DataFrame(
    {"A": ["A0", "A1", "A2"], "B": ["B0", "B1", "B2"]}, index=["K0", "K1", "K2"]
)

In [45]:
right = pd.DataFrame(
    {"C": ["C0", "C2", "C3"], "D": ["D0", "D2", "D3"]}, index=["K0", "K2", "K3"]
)

In [46]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [47]:
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [50]:
right.join(left,how="left")  # By default how=left # how= inner/left/right/outer

     C   D    A    B
K0  C0  D0   A0   B0
K2  C2  D2   A2   B2
K3  C3  D3  NaN  NaN

In [51]:
left.join(right) # By default how=left

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [53]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [54]:
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [55]:
left.join(right,how='right') 
# Left_df    (right_df)

      A    B   C   D
K0   A0   B0  C0  D0
K2   A2   B2  C2  D2
K3  NaN  NaN  C3  D3

In [56]:
left.join(right,how='inner')

     A   B   C   D
K0  A0  B0  C0  D0
K2  A2  B2  C2  D2

In [57]:
left.join(right,how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

### Null / Blank values

In [58]:
Result=left.join(right,how='outer')

In [59]:
Result

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

In [60]:
Result.isna()

        A      B      C      D
K0  False  False  False  False
K1  False  False   True   True
K2  False  False  False  False
K3   True   True  False  False

In [61]:
Result.isna().sum()

A    1
B    1
C    1
D    1
dtype: int64

In [65]:
Result

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

In [64]:
# Result.dropna()  # default axis is 0 
Result.dropna(axis=0)  # Drop rows with any null values

     A   B   C   D
K0  A0  B0  C0  D0
K2  A2  B2  C2  D2

In [66]:
Result.dropna(axis=1)  # Drop columns with any null values

Empty DataFrame
Columns: []
Index: [K0, K1, K2, K3]

In [69]:
Result.dropna(thresh=2)  # Drop rows where less than 2 non-null values are present

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

In [70]:
Result.dropna(thresh=3)  # Drop rows where less than 3 non-null values are present

     A   B   C   D
K0  A0  B0  C0  D0
K2  A2  B2  C2  D2

In [71]:
Result

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

In [72]:
Result.fillna("-")

     A   B   C   D
K0  A0  B0  C0  D0
K1  A1  B1   -   -
K2  A2  B2  C2  D2
K3   -   -  C3  D3

In [74]:
Result

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

In [75]:
Result["C"].fillna("-",inplace=True)

In [76]:
Result

      A    B   C    D
K0   A0   B0  C0   D0
K1   A1   B1   -  NaN
K2   A2   B2  C2   D2
K3  NaN  NaN  C3   D3